In [147]:
import numpy as np
import pandas as pd
"""
Series: (index, scalar value) pairs
DataFrame: (column, Series) pairs
P""anel: (item, DataFrame) pairs
"

In [148]:
df = pd.DataFrame({'one' : pd.Series(np.arange(3), index=['a', 'b', 'c']),
                   'two' : pd.Series(np.arange(4)+3, index=['a', 'b', 'c', 'd']),
                   'three' : pd.Series(np.arange(3)+6, index=['b', 'c', 'd'])}); df

   one  three  two
a  0.0    NaN    3
b  1.0    6.0    4
c  2.0    7.0    5
d  NaN    8.0    6

In [149]:
row,column = df.iloc[1], df['two'] ;row

one      1.0
three    6.0
two      4.0
Name: b, dtype: float64

In [150]:
df.sub(row, axis='columns')

   one  three  two
a -1.0    NaN -1.0
b  0.0    0.0  0.0
c  1.0    1.0  1.0
d  NaN    2.0  2.0

In [151]:
df.sub(column, axis='index')

   one  three  two
a -3.0    NaN  0.0
b -3.0    2.0  0.0
c -3.0    2.0  0.0
d  NaN    2.0  0.0

In [152]:
dfmi = df.copy()
dfmi.index = pd.MultiIndex.from_tuples([(1,'a'),(1,'b'),(1,'c'),(2,'a')],names=['first','second'])
dfmi.sub(column, axis=0, level='second')

              one  three  two
first second
1     a      -3.0    NaN  0.0
      b      -3.0    2.0  0.0
      c      -3.0    2.0  0.0
2     a       NaN    5.0  3.0

In [153]:
s = pd.Series(np.arange(10)); div, rem = divmod(s, 3); rem #idx = pd.Index(np.arange(10)) ok as well

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    0
dtype: int64

In [154]:
div, rem = divmod(s, [2, 2, 3, 3, 4, 4, 5, 5, 6, 6]) #elementwise

In [155]:
df = pd.DataFrame({'one' : pd.Series(np.arange(3), index=['a', 'b', 'c']),
                   'two' : pd.Series(np.arange(4)+3, index=['a', 'b', 'c', 'd']),
                   'three' : pd.Series(np.arange(3)+6, index=['b', 'c', 'd'])}); df

   one  three  two
a  0.0    NaN    3
b  1.0    6.0    4
c  2.0    7.0    5
d  NaN    8.0    6

In [156]:
df.sum(axis=1, skipna=True)

a     3.0
b    11.0
c    14.0
d    14.0
dtype: float64

In [157]:
(df + df == df*2).all().all()

False

In [158]:
(df+df).equals(df*2)

True

In [159]:
df1 = pd.DataFrame({'A' : [1., np.nan, 3., 5., np.nan], 'B' : [np.nan, 2., 3., np.nan, 6.]})
df2 = pd.DataFrame({'A' : [5., 2., 4., np.nan, 3., 7.], 'B' : [np.nan, np.nan, 3., 4., 6., 8.]})
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [160]:
combiner = lambda x, y: np.where(pd.isna(x), y, x)
df1.combine(df2, combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [161]:
#cum production
ddf = pd.DataFrame(index=pd.date_range('2008-11-21', periods=3, freq='3D'), data = {'Return':np.random.randn(3)})
ddf.ix["Cumulative"] = (ddf['Return']+1).prod() - 1
#ddf.ix["Cumulative"] = ((ddf+1).cumprod()-1).iloc[-1]
ddf

//anaconda/lib/python3.5/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

                       Return
2008-11-21 00:00:00 -0.021020
2008-11-24 00:00:00 -1.214277
2008-11-27 00:00:00  0.074789
Cumulative          -1.225462

In [162]:
ts_stand = (df - df.mean()) / df.std(); ts_stand.std()
(df - df.mean()).pipe(lambda x: x/ df.std()).pipe(lambda y: y.std())

one      1.0
three    1.0
two      1.0
dtype: float64

In [163]:
series = pd.Series(np.random.randn(1000))
series.nunique()
series.describe(percentiles=[.05, .25, .75, .95])

count    1000.000000
mean       -0.037924
std         1.011689
min        -3.132879
5%         -1.703007
25%        -0.687793
50%        -0.054397
75%         0.651739
95%         1.546200
max         3.841112
dtype: float64

In [164]:
frame = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No', 'No Responce'], 'b': range(5)})
frame.describe()

              b
count  5.000000
mean   2.000000
std    1.581139
min    0.000000
25%    1.000000
50%    2.000000
75%    3.000000
max    4.000000

In [165]:
frame.describe(include=['object'])
frame.describe(include=['number'])
frame.describe(include='all')

          a         b
count     5  5.000000
unique    3       NaN
top     Yes       NaN
freq      2       NaN
mean    NaN  2.000000
std     NaN  1.581139
min     NaN  0.000000
25%     NaN  1.000000
50%     NaN  2.000000
75%     NaN  3.000000
max     NaN  4.000000

In [166]:
df_ = pd.DataFrame([list(map(lambda x:x+i, list(range(3)))) for i in range(10)], columns=['A', 'B', 'C'],index=pd.date_range('1/1/2000', periods=10))
tsdf = df_.copy()
from random import shuffle
shuffle(tsdf['A'].values); shuffle(tsdf['B'].values),shuffle(tsdf['C'].values)
tsdf.apply(lambda s:[s.idxmax(),s.idxmin()])

A    [2000-01-05 00:00:00, 2000-01-03 00:00:00]
B    [2000-01-10 00:00:00, 2000-01-01 00:00:00]
C    [2000-01-03 00:00:00, 2000-01-04 00:00:00]
dtype: object

In [167]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide
tsdf.apply(subtract_and_divide, args=(5,), divide=3) 
# args is pass to function sub == 5, or you can pass directly by using arg name

                   A         B         C
2000-01-01  1.000000 -1.333333  0.666667
2000-01-02  0.000000  1.000000 -0.333333
2000-01-03 -1.666667  0.333333  2.000000
2000-01-04 -1.000000 -1.000000 -1.000000
2000-01-05  1.333333  0.666667  0.000000
2000-01-06  0.666667 -0.333333  1.000000
2000-01-07 -1.333333  0.000000  1.333333
2000-01-08 -0.333333  1.333333 -0.666667
2000-01-09 -0.666667 -0.666667  0.333333
2000-01-10  0.333333  1.666667  1.666667

In [168]:
df_.iloc[3:7] = np.nan;df_

              A     B     C
2000-01-01  0.0   1.0   2.0
2000-01-02  1.0   2.0   3.0
2000-01-03  2.0   3.0   4.0
2000-01-04  NaN   NaN   NaN
2000-01-05  NaN   NaN   NaN
2000-01-06  NaN   NaN   NaN
2000-01-07  NaN   NaN   NaN
2000-01-08  7.0   8.0   9.0
2000-01-09  8.0   9.0  10.0
2000-01-10  9.0  10.0  11.0

In [169]:
df_.apply(pd.Series.interpolate)

              A     B     C
2000-01-01  0.0   1.0   2.0
2000-01-02  1.0   2.0   3.0
2000-01-03  2.0   3.0   4.0
2000-01-04  3.0   4.0   5.0
2000-01-05  4.0   5.0   6.0
2000-01-06  5.0   6.0   7.0
2000-01-07  6.0   7.0   8.0
2000-01-08  7.0   8.0   9.0
2000-01-09  8.0   9.0  10.0
2000-01-10  9.0  10.0  11.0

In [ ]:
tsdf.agg({'A': ['mean', 'min'], 'B': 'sum'})

In [170]:
from functools import partial
q_25 = partial(pd.Series.quantile, q=0.25)
q_25.__name__ = '25%'
tsdf.agg(['count', 'mean', 'std', 'min', q_25, 'median', 'max'])

               A         B         C
count   10.00000  10.00000  10.00000
mean     4.50000   5.50000   6.50000
std      3.02765   3.02765   3.02765
min      0.00000   1.00000   2.00000
25%      2.25000   3.25000   4.25000
median   4.50000   5.50000   6.50000
max      9.00000  10.00000  11.00000

In [171]:
dfr = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'], index=pd.date_range('1/1/2000', periods=10))
dfr

                   A         B         C
2000-01-01  2.132441 -0.047523 -0.449911
2000-01-02 -1.361560 -0.653098  1.450735
2000-01-03 -0.676704  1.013997 -2.776167
2000-01-04 -0.622963  1.597599 -0.685363
2000-01-05 -1.302320 -1.025206 -0.383000
2000-01-06 -0.927101  2.028396  0.188401
2000-01-07 -1.311187  0.147633  1.292993
2000-01-08 -0.932234  0.648207 -1.160815
2000-01-09  0.193343  0.099349  0.840169
2000-01-10  0.442110 -0.471510 -0.396660

In [174]:
##transform series
dfr.apply(np.abs)
dfr.transform(np.abs)
dfr.transform('abs')
dfr.transform(lambda x: x.abs())
np.abs(tsdf)
tsdf.A.transform(np.abs)
tsdf.transform([np.abs, lambda x: x+1])

                  A                 B                 C
           absolute <lambda> absolute <lambda> absolute <lambda>
2000-01-01        8        9        1        2        7        8
2000-01-02        5        6        8        9        4        5
2000-01-03        0        1        6        7       11       12
2000-01-04        2        3        2        3        2        3
2000-01-05        9       10        7        8        5        6
2000-01-06        7        8        4        5        8        9
2000-01-07        1        2        5        6        9       10
2000-01-08        4        5        9       10        3        4
2000-01-09        3        4        3        4        6        7
2000-01-10        6        7       10       11       10       11

In [175]:
tsdf.transform({'A': np.abs, 'B': lambda x: x+1})

            A   B
2000-01-01  8   2
2000-01-02  5   9
2000-01-03  0   7
2000-01-04  2   3
2000-01-05  9   8
2000-01-06  7   5
2000-01-07  1   6
2000-01-08  4  10
2000-01-09  3   4
2000-01-10  6  11

In [176]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],index=['a', 'b', 'c', 'd', 'e'])
t = pd.Series({'six' : 6., 'seven' : 7.})
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

In [179]:
#random sampleing
import random
list = random.sample(range(10), 10)
list.sort()
from random import SystemRandom #crypto-secure random
cryptorand = SystemRandom()
cryptorand.shuffle(list)
np.random.shuffle(list)

In [181]:
import pandas.util.testing as tm
panel = tm.makePanel(5)
f = lambda x: (x.T).T ##transpose items and major_axis -> transpose major_axis and minor_axis
result = panel.apply(f, axis = ['items','major_axis'])
result.loc[:,:,'ItemA'] #you can access ItemA for A to E data

//anaconda/lib/python3.5/site-packages/pandas/core/panel.py:1138: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return self._construct_return_type(dict(results))

In [182]:
#unlike apply, you don't specify axises, so transfpose works just only 2-D
result = pd.Panel(dict([ (ax, f(panel.loc[:,:,ax]))for ax in panel.minor_axis ]))

//anaconda/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2862: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [193]:
rng = pd.date_range('1/3/2000', periods=8)
ts = pd.Series(np.random.randn(8), index=rng)
ts2 = ts[[0, 3, 6]]
ts2.reindex(ts.index, method='pad')
ts2.reindex(ts.index,).fillna(method='pad')
ts2.reindex(ts.index, method='ffill', limit=1)
#ts2.reindex(ts.index, method='ffill', tolerance='2 day')

2000-01-03    0.260049
2000-01-04    0.260049
2000-01-05         NaN
2000-01-06   -0.580787
2000-01-07   -0.580787
2000-01-08         NaN
2000-01-09   -0.941012
2000-01-10   -0.941012
Freq: D, dtype: float64

In [198]:
df
df.drop(['a', 'd'], axis=0) #is the same as
df.reindex(df.index.difference(['a', 'd']))

   one  three  two
b  1.0    6.0    4
c  2.0    7.0    5

In [199]:
df.rename(str.upper)

   one  three  two
A  0.0    NaN    3
B  1.0    6.0    4
C  2.0    7.0    5
D  NaN    8.0    6

In [200]:
df.rename(columns={'one': 'foo', 'two': 'bar'}, index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

        foo  three  bar
apple   0.0    NaN    3
banana  1.0    6.0    4
c       2.0    7.0    5
durian  NaN    8.0    6

In [201]:
s.rename("scalar-name")

a      six
b    seven
c      six
d    seven
e      six
Name: scalar-name, dtype: object

In [207]:
df = pd.DataFrame({'col1' : np.random.randn(3), 'col2' : np.random.randn(3)}, index=['a', 'b', 'c'])
#for col in df:
#    print(col)
for index, row in df.iterrows():
    print(index)
    print(row)

a
col1   -0.363831
col2    0.290392
Name: a, dtype: float64
b
col1    0.915776
col2   -0.704965
Name: b, dtype: float64
c
col1    1.926555
col2    1.580401
Name: c, dtype: float64

In [214]:
for i in df.itertuples():
    print(i)

Pandas(Index='a', col1=-0.36383065450354446, col2=0.290392486718293)
Pandas(Index='b', col1=0.9157763090741042, col2=-0.7049652988868552)
Pandas(Index='c', col1=1.9265552207726793, col2=1.580400757549667)

In [215]:
for item, frame in panel.iteritems():
    print(item)
    print(frame)

ItemA
                   A         B         C         D
2000-01-03  0.286312  1.404303 -1.077900 -1.795147
2000-01-04 -1.538415 -0.050188  0.838813  0.026829
2000-01-05  0.761207  0.457343  0.068848 -0.736735
2000-01-06  0.374352 -1.036636  1.088564  0.689739
2000-01-07 -0.555123  0.468123 -1.915482 -0.844125
ItemB
                   A         B         C         D
2000-01-03 -1.907273  1.942592  1.225258  0.584716
2000-01-04 -1.348752 -0.292559 -1.201647 -0.261475
2000-01-05  0.674415  1.037519  0.072461 -2.022662
2000-01-06 -0.722007 -0.143256  0.369944 -1.079410
2000-01-07  1.822479 -0.686075  0.219941  1.034493
ItemC
                   A         B         C         D
2000-01-03  0.567866 -1.653996  0.647270 -0.427539
2000-01-04  1.817342 -0.369365 -0.561844  1.350521
2000-01-05  0.458376  0.017080  0.536055  1.185899
2000-01-06  0.666974 -0.379528  0.002183 -0.394796
2000-01-07  0.132632  1.182626  1.555350  0.775326

In [217]:
df2 = pd.DataFrame({'x': [1, 2, 3], 'y': [4, 5, 6]})
df2.T # is the same as...

   0  1  2
x  1  2  3
y  4  5  6

In [218]:
pd.DataFrame(dict((idx,values) for idx, values in df2.iterrows()))

   0  1  2
x  1  2  3
y  4  5  6

In [219]:
dict((idx,values) for idx, values in df2.iterrows())

{0: x    1
 y    4
 Name: 0, dtype: int64, 1: x    2
 y    5
 Name: 1, dtype: int64, 2: x    3
 y    6
 Name: 2, dtype: int64}

In [225]:
#py dict constructor
#https://docs.python.org/2/tutorial/datastructures.html#dictionaries
dict([('sape', 4139), ('guido', 4127), ('jack', 4098)])
dict(sape=4139, guido=4127, jack=4098)
{x: x**2 for x in (2, 4, 6)}

{2: 4, 4: 16, 6: 36}

In [228]:
#for list item
for i, v in enumerate(['tic', 'tac', 'toe']):
    print(i,v)
#for dicrionary
knights = {'gallahad': 'the pure', 'robin': 'the brave'}
for k, v in knights.items(): ##iteritems() for py.2
    print (k, v)

0 tic
1 tac
2 toe
robin the brave
gallahad the pure

In [232]:
basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana']
for f in sorted(set(basket)):
    print (f)
##!!set removed duplication
for i in reversed(range(1,10,2)):
    print (i)
##zippig and make tuples
questions = ['name', 'quest', 'favorite color']
answers = ['lancelot', 'the holy grail', 'blue']
for q, a in zip(questions, answers):
    print ('What is your {0}?  It is {1}.'.format(q, a))

apple
banana
orange
pear
9
7
5
3
1
What is your name?  It is lancelot.
What is your quest?  It is the holy grail.
What is your favorite color?  It is blue.

In [ ]:
df1 = pd.DataFrame({'one':[2,1,1,1],'two':[1,3,2,4],'three':[5,4,3,2]})
df1.sort_values(by='two')
df1[['one', 'two', 'three']].sort_values(by=['one','two'])
s[2] = np.nan
s.sort_values()
s.sort_values(na_position='first')

In [234]:
s = pd.Series(np.random.permutation(10))
s.nsmallest(3)
s.nlargest(3)

0    9
3    8
8    7
dtype: int64

In [236]:
df1 = pd.DataFrame({'one':[2,1,1,1],'two':[1,3,2,4],'three':[5,4,3,2]})
df1.columns = pd.MultiIndex.from_tuples([('a','one'),('a','two'),('b','three')])
df1.sort_values(by=('a','two'))

    a         b
  one two three
3   1   2     4
2   1   3     2
1   1   4     3
0   2   5     1

In [ ]:
df = pd.DataFrame([['2016-07-09', datetime.datetime(2016, 3, 2)]] * 2, dtype='O')
df.apply(pd.to_datetime)